In [1]:
import pandas as pd 
import random

In [2]:
df = pd.read_csv('../porise/data/reward_nov02_nov30_exp5217.csv')

In [3]:
df.head()

     easy_id  landing_time  ct_time    service  reward
0  353942957    1604322360      NaN  pointclub     0.0
1  410217038    1604322417      NaN     rakuma     0.0
2  342269995    1604322417      NaN  pointclub     0.0
3  435689310    1604322439      NaN     rakuma     0.0
4  101334331    1604322443      NaN  pointclub     0.0

In [4]:
df.groupby(['service'])['easy_id'].count()

service
denki         23770
kaitori       17738
pay            5770
pointclub    229393
rakuma        18869
research       8597
sps           19771
toolbar       60681
Name: easy_id, dtype: int64

In [5]:
services = df.service.unique().tolist()

In [10]:
service_dict = dict()

In [11]:
for service in services:
    service_dict[service] = []

In [12]:
df.iloc[1].to_frame().T

     easy_id landing_time ct_time service reward
1  410217038   1604322417     NaN  rakuma    0.0

In [13]:
for idx in range(len(df.index)):
    entry = df.iloc[idx]
    service_dict[entry.service].append(entry)

In [14]:
services_count = {}
for service in services:
    services_count[service] = len(service_dict[service])
    print(services_count[service])

229393
18869
60681
23770
19771
8597
17738
5770

In [23]:
n_services = len(services)
print(n_services, services)

8 ['pointclub', 'rakuma', 'toolbar', 'denki', 'sps', 'research', 'kaitori', 'pay']

In [31]:
samples = []
for _ in range(int(4e5)):
    sampled_service = services[random.randint(0, n_services-1)]
    samples.append(random.choice(service_dict[sampled_service]).to_frame().T)

In [32]:
# print(samples[2])

In [33]:
sampled_df = pd.concat(samples)

In [34]:
sampled_df.head(10)

          easy_id landing_time ct_time    service reward
259755  160611251   1604521486     NaN      denki    0.0
214052  319453517   1604478009     NaN    toolbar    0.0
37153   417414447   1604344311     NaN  pointclub    0.0
326396    5564414   1604557692     NaN     rakuma    0.0
255047  411879417   1604520585     NaN   research    0.0
8948    398353748   1604326561     NaN  pointclub    0.0
327153  389095580   1604558258     NaN  pointclub    0.0
301921  213972811   1604534743     NaN    kaitori    0.0
342704    7049310   1604566213     NaN      denki    0.0
371260  411521031   1604579911     NaN    toolbar    0.0

In [35]:
sampled_df.groupby(['service', 'reward'])['easy_id'].count()

service    reward
denki      0.0000      49864
           65.3030        98
kaitori    0.0000      49583
           1.9000        640
pay        0.0000      49641
           64.3800       186
pointclub  0.0000      48711
           109.2708     1289
rakuma     0.0000      49919
           203.3600      230
research   0.0000      49864
sps        0.0000      49706
           235.0800      305
toolbar    0.0000      49540
           280.2090      424
Name: easy_id, dtype: int64

In [36]:
sampled_df.to_csv('../porise/data/sampled_rat_log_exp5217.csv', index=False)